Tekla.Structures.Drawing.Weld.WeldAttributes
The WeldAttributes class is the attributes class for the weld.

Tekla.Structures.Drawing.Weld.WeldAttributes.Representation
The representation of the weld.

Tekla.Structures.Drawing.Weld.WeldAttributes.VisibleLines
The line type of visible lines.

Tekla.Structures.Drawing.Weld.WeldAttributes.HiddenLines
The line type of hidden lines.

Tekla.Structures.Drawing.Weld.WeldAttributes.DrawHiddenLines
True if hidden lines are drawn.

Tekla.Structures.Drawing.Weld.WeldAttributes.DrawOwnHiddenLines
True if own hidden lines are drawn.

Tekla.Structures.Drawing.Weld.WeldAttributes.CustomPresentation
Custom presentation GUID to be applied to the weld

Tekla.Structures.Drawing.Weld.WeldAttributes.#ctor(System.Boolean)
Creates a new default weld attributes instance that might load attributes.
SkipLoading value does make any difference.

Tekla.Structures.Drawing.Weld.WeldAttributes.#ctor
Creates a new default weld attributes instance that loads standard attributes.

Tekla.Structures.Drawing.Weld.WeldAttributes.#ctor(System.String)
Creates a new weld attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.Weld.WeldAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.Weld.WeldAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.